////////////////////////////////////////////////////////////////////////////
//  给定两个字符串 s 和 t，它们只包含小写字母。
//  字符串 t 由字符串 s 随机重排，然后在随机位置添加一个字母。
//  请找出在 t 中被添加的字母。
////////////////////////////////////////////////////////////////////////////
//  https://leetcode-cn.com/problems/find-the-difference/description/
////////////////////////////////////////////////////////////////////////////

class Solution 
{
    public:
    
    char findTheDifference(string s, string t)
    {
        for (char c : s)
        {
            t.replace(t.find(c), 1, "");
        }
        
        return t[0];
    }
};
