//////////////////////////////////////////////////////////////////////////////////////////////////
//  编写一个算法来判断一个数是不是“快乐数”。
//  一个“快乐数”定义为：对于一个正整数，每一次将该数替换为它每个位置上的数字的平方和，
//  然后重复这个过程直到这个数变为 1，也可能是无限循环但始终变不到 1。如果可以变为 1，那么这个数就是快乐数。
//////////////////////////////////////////////////////////////////////////////////////////////////
//  https://leetcode-cn.com/problems/happy-number/description/
//////////////////////////////////////////////////////////////////////////////////////////////////

class Solution 
{
    public:
    
    bool isHappy(int n) 
    {
        map<int, bool> m;
        
        while (n != 1)
        {
            if (m.count(n))
            {
                return false;
            }
            else
            {
                m.insert(make_pair(n, true));
                
                int temp = 0;
                
                while (n > 0)
                {
                    temp += pow(n % 10, 2);
                    
                    n = n / 10;
                }
                
                n = temp;
            }
            
            if (n == 1) return true;
        }
        
        return true;
    }
};
