///////////////////////////////////////////////////////////////////////////////////////////////
//  给定一个非负整数数组 A，返回一个由 A 的所有偶数元素组成的数组，后面跟 A 的所有奇数元素。
//  你可以返回满足此条件的任何数组作为答案。
///////////////////////////////////////////////////////////////////////////////////////////////
//  https://leetcode-cn.com/problems/sort-array-by-parity/description/
///////////////////////////////////////////////////////////////////////////////////////////////

class Solution
{
    public:
    
    vector<int> sortArrayByParity(vector<int>& A)
    {
        vector<int> v;
        
        for (int i : A)
        {
            if (i%2)
            {
                v.push_back(i);
            }
            else
            {
                v.insert(v.begin(),i);
            }
        }
        
        return v;
    }
};
